postfix.org
#+INCLUDE: ./main.setup
#+TITLE: postfix
#+AUTHOR: Dongsoo Lee
#+EMAIL: dongsoolee8@gmail.com
#+DATE: 2018-02-20

* 개요
  :PROPERTIES: 
  :CUSTOM_ID: overview
  :LANG: ko
  :END:      

* 설치 방법
  :PROPERTIES: 
  :CUSTOM_ID: how-to-install
  :LANG: ko
  :END:      

** 필요 사항
   :PROPERTIES: 
   :CUSTOM_ID: prerequisites
   :LANG: ko
   :END:      

- [[./update.org][update]]

** 설치
  :PROPERTIES: 
  :CUSTOM_ID: install
  :LANG: ko
  :END:      

*** Ubuntu

#+BEGIN_SRC sh
$ sudo apt-get install postfix
#+END_SRC

** Setup

- 2. Internet Site
- domain.example.com

** 설치된 패키지
   :PROPERTIES: 
   :CUSTOM_ID: packages
   :LANG: ko
   :END:      

** 확인
   :PROPERTIES: 
   :CUSTOM_ID: check
   :LANG: ko
   :END:      

#+BEGIN_SRC sh
$ sudo postfix start
postfix: Postfix is running with backwards-compatible default settings
postfix: See http://www.postfix.org/COMPATIBILITY_README.html for details
postfix: To disable backwards compatibility use "postconf compatibility_level=2" and "postfix reload"
postfix/postfix-script: fatal: the Postfix mail system is already running

$ sudo postfix status
postfix: Postfix is running with backwards-compatible default settings
postfix: See http://www.postfix.org/COMPATIBILITY_README.html for details
postfix: To disable backwards compatibility use "postconf compatibility_level=2" and "postfix reload"
postfix/postfix-script: the Postfix mail system is running: PID: 10909

$ telnet localhost 25
Trying 127.0.0.1...
Connected to 127.0.0.1.
Escape character is '^]'.
220 gitlab.me ESMTP Postfix (Ubuntu)

quit
#+END_SRC

* 사용법
  :PROPERTIES: 
  :CUSTOM_ID: usage
  :LANG: ko
  :END:      

** 구조
   :PROPERTIES: 
   :CUSTOM_ID: syntax
   :LANG: ko
   :END:      

** 설정
   :PROPERTIES: 
   :CUSTOM_ID: configuration
   :LANG: ko
   :END:      

** 옵션
   :PROPERTIES: 
   :CUSTOM_ID: options
   :LANG: ko
   :END:      

** 사용 예
   :PROPERTIES: 
   :CUSTOM_ID: examples
   :LANG: ko
   :END:      

* 관련 항목
  :PROPERTIES: 
  :LANG: ko
  :END:      

- [[./sendmail.org][sendmail]]

* 참고자료
  :PROPERTIES: 
  :LANG: ko
  :END:      
