en/postfix.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>postfix</title>
<!-- 2018-02-25 Sun 05:37 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Dongsoo Lee" />
<meta name="google-site-verification" content="T-NdGYU-tk3BMWg0ULx4wIHD18IFoyrzEEcOoyz4xis" />
<link rel="stylesheet" type="text/css" href="/dist/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/dist/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="/dist/org-html-themes/styles/readtheorg/css/rtd-full.css"/>
<link rel="stylesheet" type="text/css" href="/dist/org-html-themes/styles/readtheorg/css/emphasis.css"/>
<link rel="stylesheet" type="text/css" href="/dist/assets/css.css"/>
<link href="https://maxcdn.bootstrapcdn.com/font-awesome/4.7.0/css/font-awesome.min.css" rel="stylesheet" integrity="sha384-wvfXpqpZZVQGK6TAh5PVlGOfQNHSoD2xbE+QkPxCAFlNEevoEH3Sl0sibVcOQVnN" crossorigin="anonymous">
<meta name="title" content="postfix - Linux Commands">
<meta name="description" content="">
<meta name="by" content="Dongsoo Lee">
<meta property="og:type" content="article">
<meta property="og:title" content="postfix - Linux Commands">
<meta property="og:description" content="">
<meta name="twitter:title" content="postfix - Linux Commands">
<meta name="twitter:description" content="">
</head>
<body>
<div id="content">
<h1 class="title">postfix</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#how-to-install">How to Install</a>
<ul>
<li><a href="#prerequisites">Prerequisites</a></li>
<li><a href="#install">Install</a>
<ul>
<li><a href="#sec-1-2-1">Ubuntu</a></li>
</ul>
</li>
<li><a href="#sec-1-3">Setup</a></li>
<li><a href="#packages">Installed Packages</a></li>
<li><a href="#check">Check</a></li>
</ul>
</li>
<li><a href="#seealso">See also</a></li>
</ul>
</div>
</div>

<div id="outline-container-how-to-install" class="outline-2">
<h2 id="how-to-install"><a id="sec-1" name="sec-1"></a>How to Install</h2>
<div class="outline-text-2" id="text-how-to-install">
</div>

<div id="outline-container-prerequisites" class="outline-3">
<h3 id="prerequisites"><a id="sec-1-1" name="sec-1-1"></a>Prerequisites</h3>
<div class="outline-text-3" id="text-prerequisites">

<ul class="org-ul">
<li><a href="./update.html">update</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-install" class="outline-3">
<h3 id="install"><a id="sec-1-2" name="sec-1-2"></a>Install</h3>
<div class="outline-text-3" id="text-install">
</div>

<div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1">Ubuntu</h4>
<div class="outline-text-4" id="text-1-2-1">
<div class="org-src-container">

<pre class="src src-sh">$ sudo apt-get install postfix
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Setup</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>2. Internet Site
</li>
<li>domain.example.com
</li>
</ul>
</div>
</div>

<div id="outline-container-packages" class="outline-3">
<h3 id="packages"><a id="sec-1-4" name="sec-1-4"></a>Installed Packages</h3>
<div class="outline-text-3" id="text-packages">
</div>
</div>

<div id="outline-container-check" class="outline-3">
<h3 id="check"><a id="sec-1-5" name="sec-1-5"></a>Check</h3>
<div class="outline-text-3" id="text-check">

<div class="org-src-container">

<pre class="src src-sh">$ sudo postfix start
postfix: Postfix is running with backwards-compatible default settings
postfix: See http://www.postfix.org/COMPATIBILITY_README.html for details
postfix: To disable backwards compatibility use <span style="font-style: italic;">"postconf compatibility_level=2"</span> and <span style="font-style: italic;">"postfix reload"</span>
postfix/postfix-script: fatal: the Postfix mail system is already running

$ sudo postfix status
postfix: Postfix is running with backwards-compatible default settings
postfix: See http://www.postfix.org/COMPATIBILITY_README.html for details
postfix: To disable backwards compatibility use <span style="font-style: italic;">"postconf compatibility_level=2"</span> and <span style="font-style: italic;">"postfix reload"</span>
postfix/postfix-script: the Postfix mail system is running: PID: 10909

$ telnet localhost 25
Trying 127.0.0.1...
Connected to 127.0.0.1.
Escape character is <span style="font-style: italic;">'^]'</span>.
220 gitlab.me ESMTP Postfix (Ubuntu)

quit
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-seealso" class="outline-2">
<h2 id="seealso"><a id="sec-2" name="sec-2"></a>See also</h2>
<div class="outline-text-2" id="text-seealso">

<ul class="org-ul">
<li><a href="./sendmail.html">sendmail</a>
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-02-20</p>
<p class="author">Author: Dongsoo Lee</p>
<p class="date">Created: 2018-02-25 Sun 05:37</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
